"use strict";
// Basic Types 
// Primitive types (number, string, boolean)
// Arrays
// tuples
// Enums
// Any, Unknwon, Void, Null Undifined, Never
// any
// 📌 কেন ব্যবহার হয়:
// যখন আপনি জানেন না ভ্যারিয়েবলটা কী ধরনের হবে, অথবা যেকোনো টাইপের ভ্যালু রাখার দরকার — তখন any ব্যবহার করা হয়।
// ⚠️ সতর্কতা:
// any টাইপ ব্যবহার করলে TypeScript টাইপ চেক করা বন্ধ করে দেয় — এটা ভুল ধরবে না।
// let data : number ;
// data = 12;
// data = true
// unknowon
// let a : unknown ;
// a = 12;
// a = "infan";
// if(typeof a ===  "infan")
