// Primitive টাইপ হলো সবচেয়ে সাধারণ এবং মৌলিক ডেটা টাইপ যা TypeScript/JavaScript ভাষা সরবরাহ করে। এই টাইপগুলো immutable, অর্থাৎ একবার তৈরি হলে তার ভ্যালু পরিবর্তন করা যায় না (তবে ভ্যারিয়েবলটি অন্য মানে রি-অ্যাসাইন করা যায়)।



// string	"Hello"	টেক্সট বা লেখা বোঝায়
// number	123, 3.14	সংখ্যার জন্য — পূর্ণসংখ্যা ও দশমিক সংখ্যা
// boolean	true, false	সত্য/মিথ্যা মান বোঝাতে ব্যবহার হয়
// null	null	ইচ্ছাকৃতভাবে কিছু নেই বোঝাতে ব্যবহৃত
// undefined	undefined	ভ্যারিয়েবল আছে কিন্তু মান দেওয়া হয়নি
// bigint	1234567890123n	খুব বড় সংখ্যা সংরক্ষণের জন্য
// symbol	Symbol("id")	ইউনিক শনাক্তকারী, সাধারণত object key হিসেবে ব্যবহৃত হয়
